In [ ]:
import matplotlib.pyplot as plt

In [ ]:
import numpy as np

In [ ]:
rg = np.random.default_rng(1)
rg

In [ ]:
v = rg.normal(mu, sigma, 10000)
v

In [3]:
# Pandas Basics
from IPython.display import Image 

from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [ ]:
obj = Series([4, 7, -5, 3])
obj

In [ ]:
obj = Series([4,7,-5,3])
obj

In [ ]:
obj.index

In [ ]:
obj[1]

In [ ]:
obj.values

In [1]:
%pwd

'C:\\Users\\student\\Anaconda_src\\S01_Pyton_Review'

In [ ]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

In [ ]:
obj3 = Series([1,2,3,4], index = ['a','b','c','d'])
obj3

In [ ]:
obj3 = Series([1,2,3,4], index = ['a','b','c'])
obj3

In [ ]:
?Series

In [ ]:
obj3.index

In [ ]:
obj3['a']

In [ ]:
obj3['e']

In [ ]:
obj3[obj3 < 0]

In [ ]:
obj3 * 2

In [ ]:
np.exp(obj3)

In [ ]:
'b' in obj3

In [ ]:
'e' not in obj3

In [ ]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

* 인덱스를 갈아 끼울 수 있다.

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas','Utah']
odj4 = Series(sdata, index = states)
odj4

In [ ]:
obj3.index

In [ ]:
obj3.values

In [2]:
obj3.items

Object `obj3.items` not found.

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index = states)
obj4

In [ ]:
pd.isnull(obj4)

In [ ]:
pd.notnull(obj4)

In [ ]:
obj4.isnull()

In [ ]:
obj3

In [ ]:
obj4

In [ ]:
obj3 + obj4

In [ ]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

In [ ]:
obj

In [ ]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

In [ ]:
for index, value in sdata.items():
    print( '{0} : {1}' .format(index, value))

In [ ]:
# DataFrame 객체 생성1
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [ ]:
frame

In [ ]:
DataFrame(data,columns = ['year','state'])

In [ ]:
# 순서를 지정
DataFrame(data, columns=['year', 'state', 'pop'])

In [ ]:
# DataFrame 객체 생성2
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

In [ ]:
frame2.columns

In [ ]:
frame2['state']

In [ ]:
frame2.year

In [ ]:
# 로우는 위치나 ix 메소드를 통해 접근
frame2.ix['three']

In [ ]:
frame2.loc['three']

*라벨명은 loc, range는 iloc로 가져온다.

In [ ]:
frame2.iloc[2]

In [ ]:
frame2.iloc[0]

In [ ]:
frame2['debt'] = np.arange(5.)
frame2

In [ ]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

In [ ]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

*drop은 view형태만 삭제한다.

In [ ]:
frame2.drop(columns = 'pop', inplace = True)
frame2

In [ ]:
frame2 = frame2c
frame2

In [ ]:
frame2.drop('year',axis=1)

In [ ]:
frame2.drop('one')

In [ ]:
frame2.drop('two',axis = 0)

In [ ]:
frame2

In [ ]:
frame2['favoriate'] = frame2.year > 2000
frame2

In [ ]:
# 칼럼을 삭제
del frame2['eastern']
frame2.columns

In [ ]:
frame2

In [ ]:
frame2c = frame2.copy()
frame2c

In [ ]:
frame2c.base is frame2

In [ ]:
frame2c.flags.owndata

In [ ]:
frame2v=frame2.view()
frame2v

In [ ]:
# DataFrame 객체 생성3  
# 중첩된 dict, 바깥 사전의 키값이 칼럼이 되고 안의 키는 로우가 된다.
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio'  : {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)

In [ ]:
frame3

In [ ]:
# NumPy에서 처럼 결과값의 순서 뒤집기
frame3.T

In [ ]:
DataFrame(pop, index=[2001, 2002, 2003])

In [ ]:
frame3=DataFrame(pop, index=[2000, 2001, 2002])

In [ ]:
frame3

In [ ]:
frame3['Ohio'][::-1]

In [ ]:
frame3['Nevada'][:2]

In [ ]:
pdata = {'Ohio'  : frame3['Ohio'][::-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

In [ ]:
frame2

In [ ]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

In [ ]:
obj

In [ ]:
index[::-1]

In [ ]:
# 색인객체 변경시 TypeError 발생!!
# index[1] = 'd'

In [ ]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index = index)
obj2.index is index

In [ ]:
index = pd.Index(np.arange(3))
index
obj2 = Series([1.2,-3.0,1], index = index)
obj2.index

In [ ]:
frame3

In [ ]:
frame3 = DataFrame(pop, index=[2000, 2001, 2002])

In [ ]:
frame3

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2002 in frame3.index

In [ ]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

In [ ]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

In [ ]:
# ffill 메소드 : 앞의 값으로 누락된 값을 채워 넣기
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method = 'ffill')

In [ ]:
obj3

In [ ]:
obj3.reindex(range(6), fill_value = 0)

In [ ]:
obj3.reindex(range(6), method = 'ffill')

In [ ]:
obj3.reindex(range(6), method = 'bfill')

In [ ]:
# bfill 메소드 : 뒤의 값으로 누락된 값을 채워 넣기
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='bfill')

In [ ]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

In [ ]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

In [ ]:
frame.reindex(index = ['a', 'b', 'c', 'd'], columns = states)

In [ ]:
frame.loc['a':'d']

In [ ]:
frame.iloc[0:2]

In [ ]:
# frame.loc[['a', 'b', 'c', 'd'], states]

In [ ]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a','b','c']
                  ,columns = ['오하이오','전주','서울'])
frame

In [ ]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

In [ ]:
obj.drop(['d', 'c'])

In [ ]:
obj

In [8]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.drop('three',axis=1)

In [6]:
data.drop(['Colorado', 'Ohio'], inplace = True)
data

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.drop('two', axis=1)

In [ ]:
data.drop(['two', 'four'], axis=1)

In [7]:
data

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [23]:
obj = DataFrame(np.arange(9).reshape((3,3)), index = ['가','나','다'], \
             columns = ['a','b','c'])
obj

   a  b  c
가  0  1  2
나  3  4  5
다  6  7  8

In [10]:
obj['b']

1.0

In [11]:
obj[1]

1.0

In [12]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [13]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [14]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [15]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [16]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [17]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [5]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [26]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [40]:
data[:2]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7

In [30]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
# 요건 문법적으로 모순이 있으나, 실용성에 기인한 것일뿐
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [33]:
data[data < 5] = 0

In [43]:
data[:2]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7

In [6]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [12]:
data.iloc[2,[2]]

three    10
Name: Utah, dtype: int32

In [36]:
# data.ix[['Colorado', 'Utah'], [3, 0, 1]]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [37]:
data.ix[2]

AttributeError: 'DataFrame' object has no attribute 'ix'